<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
  <%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c" %>
    <!DOCTYPE html>
    <html lang="en">

    <head>
      <meta charset="UTF-8" />
      <meta name="viewport" content="width=device-width, initial-scale=1.0" />
      <title>Document</title>

      <style>
        .container {
          display: flex;
          width: 80%;
          height: 80px;
          margin: 0 auto;
          align-items: flex-end;
        }

        .title {
          background: transparent url('/img/logoHeader.png') no-repeat center;
          flex-grow: 3;
          min-width: 298px;
          min-height: 75px;
          margin-right: 50px;
        }

        .popular {
          display: flex;
          background: #e8ebf1;
          flex-grow: 4;
          border: 1px solid lightgray;
          height: 60px;
        }

        .real-time {
          display: flex;
          justify-content: center;
          align-items: center;
          flex-grow: 1;
          min-width: 200px;
        }

      .likeBtn {
        text-decoration: none;
      }

      #ftvModalSty {
        border-bottom: 1px solid #ddd;
        padding-top: 5px;
        padding-bottom: 15px;
      }
      #ftvName {
        margin-top: 5px;
      }
      #ftvUrl {
        text-decoration-line: none;
      }
      #ftvUrl:hover {
        color: black;
      }
      /* 무한 스크롤*/
      #container {
        border: 1px solid #ddd;
        max-width: 600px;
        margin: 0 auto;
        padding: 20px;
      }

      .item {
        border: 1px solid #ccc;
        margin: 10px 0;
        padding: 10px;
      }
      #contentDiv {
        height: 50vh;
        overflow-y: auto;
      }
    
        .real-time .sound-icon {
          width: 20px;
          height: 30px;
          background: transparent url('/img/soundIcon.png') no-repeat center;
          margin-right: 10px;
        }

        .real-time .real-time-icon {
          font-weight: bold;
        }

        .fest-name {
          display: flex;
          align-items: center;
          flex-grow: 5;
          padding-left: 10px;
          border-left: 3px solid rgba(204, 202, 202, 0.929);
          min-width: 200px;
        }

        .fest-name span {
          font-weight: bold;
        }

        .counter-container {
          display: flex;
          flex-direction: column;
          justify-content: center;
          padding-right: 50px;
        }

        .btn-area {
          display: flex;
          flex-grow: 0.5;
          justify-content: space-around;
          align-items: center;
          margin-left: 44px;
        }

        .btn-area>.botton {
          width: 14rem;
          padding: 0px;
          margin: 0px;
          display: flex;
          position: relative;
          left: 66px;
          top: -15px;
          justify-content: space-between;
        }

        .btn-area .btn {
          /* background-color: #0356a9; */
          color: white;
          line-height: 30px;
          width: 100px;
          height: 30px;
          border-radius: 20px;
          border: none;
          text-align: center;
          text-decoration: none;
        }

        .btn-area .like {
          background: url('/img/like.png') no-repeat center;
          text-indent: -9999px;
          margin-bottom: 7px;
          /* border: 1px solid black; */
        }

        .btn-area .like:hover {
          background: url('/img/likeDarker.png') no-repeat center;
          text-indent: -9999px;
          margin-bottom: 7px;
        }

        .login-btn {
          margin-bottom: 7px;
          padding: 3px;
          transition: 0.5s;
          background-size: 200% auto;
          color: white;
          background-image: linear-gradient(to right,
              #457acf 0%,
              #83bad1 51%,
              #a1c4fd 100%);
        }

        .login-btn:hover {
          background-position: right center;
        }

        .join-btn {
          margin-bottom: 7px;
          padding: 3px;
          transition: 0.5s;
          background-size: 200% auto;
          color: white;
          background-image: linear-gradient(to right,
              #457acf 0%,
              #83bad1 51%,
              #a1c4fd 100%);
        }

        .join-btn:hover {
          background-position: right center;
        }

        /*****모달창*****/

        a.button {
          display: inline-block;
          padding: 10px 20px;
          text-decoration: none;
          color: #fff;
          background: #000;
          margin: 20px;
        }

        #modal {
          display: none;
          position: fixed;
          width: 100%;
          height: 100%;
          top: 0;
          left: 0;
          background: rgba(0, 0, 0, 0.3);
        }

        .modal-con {
          display: none;
          position: fixed;
          top: 50%;
          left: 15%;
          transform: translate(-50%, -50%);
          width: 300px;
          height: 500px;
          background: #fff;
        }

        .modal-header {
          font-size: 20px;
          padding: 20px;
          background: skyblue;
        }

        .modal-con .con {
          font-size: 15px;
          line-height: 1.3;
          padding: 30px;
        }

        .modal-con .close {
          display: block;
          position: absolute;
          width: 30px;
          height: 30px;
          border-radius: 50%;
          border: 3px solid #000;
          text-align: center;
          line-height: 30px;
          text-decoration: none;
          color: #000;
          font-size: 20px;
          font-weight: bold;
          right: 10px;
          top: 10px;
        }

        .portal {
          font-size: 15px;
        }
        
      </style>
      <script src="https://code.jquery.com/jquery-3.7.0.min.js"></script>
    </head>

    <body>
      <div class="container">
        <a href="${pageContext.request.contextPath}/" class="title"></a>
        <div class="popular">
          <div class="real-time">
            <div class="sound-icon"></div>
            <div class="real-time-icon">
              <div id="generateButton">이런 축제 어때요</div>
            </div>
          </div>
          <div class="fest-name"><span id="festivalName"></span></div>
          <div id="result"></div>
        </div>
        <div class="btn-area">
          <div class="btn-area botton">
            <c:if test="${login == null}">
              <a id="loginBtn" class="btn login-btn" href="${pageContext.request.contextPath}/user/login">로그인</a>
              <a id="joinBtn" class="btn join-btn" href="${pageContext.request.contextPath}/user/join">회원가입</a>
            </c:if>
            <c:if test="${login != null}">
              <a id="myPageBtn" class="btn myPage-btn" href="${pageContext.request.contextPath}/user/myPage">마이페이지</a>
              <a id="logoutBtn" class="btn logout-btn" href="${pageContext.request.contextPath}/user/logout">로그아웃</a>
              <a href="javascript:openModal('modal1');" class="btn like">좋아요목록</a>
            </c:if>
          </div>
        </div>
      </div>

    <!-- 좋아요 목록 모달-->
    <div id="modal"></div>
    <div class="modal-con modal1">
      <div class="modal-header">
        <a
          href="#"
          class="portal"
          >검색</a
        >
        <button
          type="button"
          class="close-area"
        >
          X
        </button>

        <div id="contentDiv">
          <!-- 좋아요 리스트 넣을 태그 -->
        </div>
      </div>

        <!-- 페이징 목록 -->
        <div class="board_list_wrap">
          <div class="board_list">
            <c:forEach var="num" begin="${pc.begin}" end="${pc.end}">
              <div class="ftv">
                <div class="num">${num}</div>
                <div class="modal_title"><a href="#">${ftvName}</a></div>
                <a href="#">
                  <div class="likeBtn">♡</div>
                </a>
              </div>
            </c:forEach>
          </div>
        </div>
      </div>


      <div></div>

    </div>

    <div></div>

    <script>
      function openModal(modalname) {
        $('#modal').fadeIn(300);
        $('.' + modalname).fadeIn(300);
        document.querySelector('.modal1').style.zIndex = '10';
      }

      $('#modal, .close-area').on('click', function () {
        $('#modal').fadeOut(300);
        $('.modal1').fadeOut(300);
      });

      const userIdVal = '${login}';
      let str = ''; // 좋아요 리스트 불러 올 변수
      // 좋아요 리스트 구현
      const $likeBtn = document.querySelector('.like');
      // 가상의 데이터 배열

      // 보여줄 아이템 개수
      const itemsPerPage = 1;

      // 현재 페이지

      let currentPage = 1;

      // 컨테이너 엘리먼트
      const $container = document.getElementById('contentDiv');
      const item = document.createElement('div');

      $likeBtn.addEventListener('click', (e) => {
        console.log('좋아요 리스트 클릭', userIdVal);

        fetch('${pageContext.request.contextPath}/user/likeList/' + userIdVal)
          .then((res) => res.json())
          .then((list) => {
            console.log('좋아요리스트 클릭시: ', list);

            for (likeList of list) {
              str +=
                `<!-- 축제명 -->
                            <div class="festivalName">
                               <strong><h4 id='ftvName'><p>` +
                likeList.ftvName +
                `</p></h4></strong></div>
                                <div class="festivalPhone">
                                <h6><p id='ftvPhone'>` +
                likeList.phone +
                `</p></h6></div>
                                  <div class="festivalPlace">
                                    <h6><p id='ftvPlace'>` +
                likeList.place +
                `</p></h6></div>
                                      <div class="festivalRoad">
                                        <h6><p id='ftvRoad'>` +
                likeList.roadAddr +
                `</p></h6></div>
                                        <div class="festivalUrl">
                                        <small><h5  id='ftvModalSty'><a href="` +
                likeList.url +
                `" id='ftvUrl'>
                                          홈페이지</a></h5></small></div>
                                          `;
            }
            const data = Array.from({ length: 1 }, (_, index) => str);
            // 아이템을 생성하여 컨테이너에 추가하는 함수
            function appendItems(page, itemsPerPage) {
              const start = (page - 1) * itemsPerPage;
              const end = start + itemsPerPage;
              for (let i = start; i < end; i++) {
                item.className = 'item';
                $container.appendChild(item);
                item.innerHTML = data[i];
              }
            }
            // 초기 아이템 추가
            appendItems(currentPage, itemsPerPage);

            // 스크롤 이벤트 감지
            // window.addEventListener('scroll', () => {
            //   const currentScroll = window.scrollY;
            //   const windowHeight = window.innerHeight;
            //   const bodyHeight = document.body.clientHeight;
            //   const paddingBottom = 200;
            //   // if (
            //   //   currentScroll + windowHeight + paddingBottom >=
            //   //   bodyHeight - 10
            //   // )
            //   // {
            //   //   // 스크롤이 바닥에 닿았을 때 새로운 아이템 추가
            //   //   currentPage++;
            //   //   appendItems(currentPage, itemsPerPage);
            //   // }
            // });
          });
        item.innerHTML = '';
      });

      const festivalNames = {
        1: '2022년 순천민주주의 정책 페스티벌',
        2: '제23회 순천만 갈대축제',
        3: '2022 순천만국가정원 별빛산책',
        4: '드림러브페스티벌',
        5: '순천향매실 동네방네 매화축제',
        6: '조곡동벚꽃축제',
        7: '순천명품 월등복숭아 체험행사',
        8: '서면 드림 축제',
        9: '제5회 철도마을축제 및 제3회 어린이동요제',
        10: '추석맞이 조곡동 한마당 행사',
        11: '강릉커피축제',
        12: '전국생활문화축제 in강릉',
        13: '2022 강릉와인축제',
        14: '2022 강릉누들축제',
        15: '군위 삼장군단오축제',
        16: '김수환추기경 사랑과 나눔 문화축전',
        17: '군포철쭉축제',
        18: '4월 마토예술제<인형극이랑 놀자>',
        19: '더 스프링 시즌 A.D.H.D. 페스티벌',
        20: '고싸움놀이축제',
        21: '굿모닝양림축제',
        22: '노대 에코 페스티벌',
        23: '마곡사 신록축제',
        24: '제68회 백제문화제',
        25: '제5회 겨울공주 군밤축제',
        26: '제1회 유구색동수국정원 꽃축제',
        27: '제29회 화도진축제',
        28: '보이지 않아도 보이는',
        29: 'Creative energy_김정현 개인展',
        30: '2022년 강원PAX아라리 제 3회 정기연주회',
        31: '제33회 화도진축제',
        32: '제34회 화도진축제',
        33: '6월 마토예술제<원더풀파티>',
        34: '제13회 평택록페스티벌&전국밴드경연대회',
        35: '제11회 평택 가족캠핑 스마트영상제',
        36: '더 어텀 시즌 아트&플레이 페스타',
        37: '제10회 노을동요제',
        38: '평택호물빛축제',
        39: '화순화학산철쭉제',
        40: '화순적벽문화축제',
        41: '구례산수유꽃축제',
        42: '구례300리벚꽃축제',
        43: '지리산남악제',
        44: '구례뮤직페스티벌',
        45: '구례동편소리축제',
        46: '지리산피아골단풍축제',
        47: '울산옹기축제',
        48: '제27회 화도진축제',
        49: '제28회 화도진축제',
        50: '제13회 남한강축제',
        51: '제30회 화도진축제',
        52: '동구문화예술한마당&막걸리페스티벌',
        53: '제2회 광주 버스킹 월드컵',
        54: '2023계룡軍문화축제',
        55: '금천하모니축제 2023',
        56: '동대문구 봄꽃축제',
        57: '선농대제',
        58: '서울장미축제',
        59: '용마폭포 문화예술축제',
        60: '제10회 서울동화축제',
        61: '제5회 명품한강 장미축제',
        62: '제1회 중곡2동 긴고랑 왕벚꽃축제',
        63: '제1회 중곡3동 벚꽃축제',
        64: '동래읍성역사축제',
        65: '제24회 화성 효 마라톤 대회',
        66: '제1회 도농 어울림 축제',
        67: '제9회 화성송산포도축제',
        68: '정조 효 문화제 및 정조대왕 능행차 공동재현',
        69: '2023 화성 학생동아리 축제',
        70: '화성 루나 빛 축제',
        71: '2023 화성시민 한마음 체육대회',
        72: '울산고래축제',
        73: '화순백아산철쭉제',
        74: '화순운주문화축제',
        75: '도봉 과학축전',
        76: '치악산찰옥수수축제',
        77: '치악산복숭아축제',
        78: '2023 원주 댄싱카니발',
        79: '원주삼토페스티벌',
        80: '치악산한우축제',
        81: '원주 독서대전',
        82: '원주 평생학습 축제',
        83: '방선문축제',
        84: '설문대할망 페스티벌(제주돌문화공원)',
        85: '제주 에코뮤직페스티벌',
        86: '2023 서귀포문화재 야행',
        87: '제5회 상록수문화제',
        88: '안산국제거리극축제',
        89: '여르미오페스티벌',
        90: '제6회 상록수문화제',
        91: '안산국제거리극축제',
        92: '제7회 상록수문화제',
        93: '안산국제거리극축제',
        94: '단종문화제',
        95: '동강국제사진제',
        96: '영월동강뗏목축제',
        97: '계양산국악제',
        98: '9월 마토예술제<지구의 안정을 지켜라>',
        99: '평택 원평나루억새축제',
        100: '11월 마토예술제',
        101: '곡성세계장미축제',
        102: '기차마을아이스페스티벌',
        103: '곡성심청어린이대축제',
        104: '경산자인단오제',
        105: '양양문화제',
        106: '양양 송이&연어축제',
        107: '2023년 울산공업축제',
        108: '울산옹기축제',
        109: '간절곶 해맞이 축제',
        110: '울산쇠부리축제',
        111: '울산고래축제',
        112: '궁거랑 벚꽃 한마당',
        113: '춘천낭만여행 - 풍물장 새봄맞이 신명굿',
        114: '춘천전쟁과 일상 국제문학포럼 2020 -한국전쟁 후-',
        115: '이계통간異系統間 배요한 박예지 2인전',
        116: '춘천인형극박물관 재개관 전시 인형의 기술',
        117: '최정숙 개인전 호모 하모니쿠스 Homo Harmonicus',
        118: '2020 서현종 개인전 - 청.춘.천 展',
        119: '2020 강원문화재단 원로예술인 공연 생일 - The Dark',
        120: '춘천뿌리展_The Exhibition of Roots',
        121: '춘천선열의 얼과 소통하다 한중수교 30주년기념 국제 초청 서예전 강원서예협회 정기전',
        122: '2022 마임 아카데미 움직임 창작자를 위한 워크숍 비행飛行',
        123: '제로섬씽',
        124: '마스터클래스 23회차 영혼의 기타리스트 이근형 vs 괴물연주자 베이시스트 장태웅',
        125: '김홍열 사진전_Moment',
        126: '老雲 安淙重 篆刻展노운 안종중 전각전_안종중 개인전',
        127: '소小 소素 소笑_김현숙 개인전',
        128: '2022 춘천도서전-춘천 쓰고 읽고 말하다.',
        129: '정춘일 개인전 - 삼 .철. 리 바람 展',
        130: '지나가는 여름이 아쉬운 사람들을 위한 블루요선 여행페스타',
        131: '축성탄 저세상 텐션으로의 초대 안녕 팥쥐',
        132: 'Christmas Festival - 제 9회 정기연주회',
        133: '음악극 피터와 동물의 사육제',
        134: '제2회 호반음악제 피아졸라 나이트클럽 인 춘천',
        135: '제4회 셰익스피어 페스티벌 셰익스피어 맥베스를 연주하다',
        136: 'FESTA NYCC 2021 온라인 페스타 뉴욕 in 춘천',
        137: '2021춘천마임축제 물화일체',
        138: '2021춘천마임축제 도깨비 유랑단',
        139: '박양순 명창 판소리 흥보가 완창 공연',
        140: '2021 춘천 한국지역도서전',
        141: '음악으로 보는 이미지극 보이체크',
        142: '2021 꿈의 오케스트라 강릉 언택트 연주회 향상더하기',
        143: '순천 문화재 야행',
        144: '춘천예술문화축제 한여름 밤의 아리아',
        145: '제2회 봄내 전국 시낭송대회',
        146: '춘천 핸드크래프트 프리마켓 어뮤즈데이',
        147: '김유정 83주기 추모공연 김유정을 연주하다 그 삶의 이중주',
        148: '농악대축제',
        149: '소하도서관 책축제 팔짱+책을 품다',
        150: '농악대축제',
        151: '구름산예술제',
        152: '제7회 목감천 친환경 축제',
        153: '평생학습도시 선언 20주년 컨퍼런스',
        154: '2022 페스티벌 광명',
        155: '구름산예술제',
        156: '구름산예술제',
        157: '제27회 오리문화제',
        158: '연풍조령문화제',
        159: '동해무릉제',
        160: '제18회 파주개성인삼축제',
        161: '제27회 파주장단콩축제',
        162: '제33회 율곡문화제',
        163: '춘천마임축제 걷다 보는 마임',
        164: '춘천마임축제 대학로 문화의 거리',
        165: '제33회 춘천인형극제 국내 참가작 공모',
        166: '2020 역발상전',
        167: '만나고 싶었습니다 - 창작의 자극 그리고 예술로 환기',
        168: '공공미술렌탈프로젝트 춘천예술공감공공청사 미술 전시展',
        169: '제18회 강원아트페어 춘천전 자연에서 다시 태어나는 예술',
        170: '안성환 무심 無心 -쉬어 가다',
        171: '2022 강원도 지역문제 발견 오픈테이블',
        172: '제 29회 봄내예술제 봄내미술인전_시민과 예술인의 만남',
        173: '춘천 핸드메이드 브랜드와 함께 하는 마켓396 5월',
        174: '연극뷰티풀라이프-춘천',
        175: '2022춘천막국수닭갈비축제',
        176: '2022 청년 문화정책을 더하다',
        177: '마켓396 10월HALLOWEEN MARKET',
        178: '2022 춘천 “별의 별Star & Star Folk concert',
        179: '墨-사람다움을 담다',
        180: '태백 황지연못 황부자며느리 축제',
        181: '철암 단풍축제',
        182: '태백산 눈축제',
        183: '2023 제25회 제주들불축제',
        184: '전농로 왕벚꽃 축제',
        185: '제5회 애월읍 왕벚꽃 축제',
        186: '서귀포 유채꽃 국제걷기대회',
        187: '황매산 철쭉제',
        188: '합천바캉스축제',
        189: '황매산 억새 축제',
        190: '합천기록문화축제',
        191: '2023년 울진대게와 붉은대게 축제',
        192: '대전효문화뿌리축제',
        193: '구시청나이트페스티벌',
        194: '구시청나이트페스티벌',
        195: '2023 광주문화재야행',
        196: '제20회 광주 추억의 충장축제',
        197: '지봉로 상사화 축제',
        198: '천태만상 상권연계 공감 페스티벌',
        199: '제9회 향동 마을축제 「은행나무 아래로」',
        200: '제8회 상록수문화제',
        201: '제9회 상록수문화제',
        202: '안산국제거리극축제',
        203: '여르미오페스티벌',
        204: 'Green life Green art',
        205: '제17회 영등포 여의도 봄꽃축제',
        206: '치악산왕발걸음축제',
        207: '제25회 원주한지문화제',
        208: '제16회 용수골꽃양귀비축제',
        209: '제21회 장미축제',
        210: '제18회 충청남도 국악제',
        211: '제2회 아트밸리 아산 오페라 갈라콘서트',
        212: '아트밸리 아산 락 페스티벌',
        213: '아트밸리 아산 별빛음악제',
        214: '제5회 인제가을꽃축제',
        215: '제23회 정동진독립영화제',
        216: '강릉문화재야행',
        217: '고창벚꽃축제',
        218: '바지락 오감체험 페스티발',
        219: '고창청보리밭축제',
        220: '동학농민혁명 무장기포기념제',
        221: '고창복분자와수박축제',
        222: '무등울림축제',
        223: '광주푸드페스타',
        224: '강동선사문화축제',
        225: '석촌호수벚꽃축제',
        226: '한성백제문화제',
        227: '제23회소래포구축제',
        228: '울산쇠부리축제',
        229: '제4회 상록수문화제',
        230: '안산국제거리극축제',
        231: '2019 안양충훈벚꽃축제',
        232: '2019 안양여성축제',
        233: '2019 광복기념음악회',
        234: '진주영 틈',
        235: '장혜란 개인전 - Back ground',
        236: '화이트릭스마스2 산타피습사건',
        237: '김명숙 영혼의 정원',
        238: '제18회 춘천현대사생대회展',
        239: '천년 고려 숨결로 만나는 청평유람淸平流覽 좋을씨구',
        240: '그래미 수상자와 함께하는 춘천 10년의 문화동행 FESTA NYCC 2022',
        241: '길종갑 사창리사람들',
        242: '도보여행 서숙희이효숙최선아이현정최유선최덕화LUCY',
        243: '삶의 순환',
        244: '강원도립극단 연극 카페인',
        245: '윤명식 개인전',
        246: '제1회 상록수문화제',
        247: '제2회 상록수문화제',
        248: '안산국제거리극축제',
        249: '여르미오페스티벌',
        250: '제3회 상록수문화제',
        251: '안산국제거리극축제',
        252: '여르미오페스티벌',
        253: '서산국화축제',
        254: '(코로나로 일정 미정)서산어리굴젓축제',
        255: '(코로나로 일정 미정)서산뻘낙지먹물축제',
        256: '제주목관아 야간개장',
        257: '제8회 제주푸드앤와인페스티벌',
        258: '2023 청수 곶자왈 반딧불이 축제',
        259: '제41회 대한민국연극제 제주',
        260: '김만덕주간 나눔큰잔치',
        261: '만덕제',
        262: '2023 대덕물빛축제',
        263: '동춘당문화제',
        264: '구민화합대잔치',
        265: '광주미디어아트페스티벌',
        266: '광주프린지페스티벌',
        267: '광주세계김치축제',
        268: '영산강 서창들녘 억새축제',
        269: '굿모닝 양림',
        270: '광주 추억의 충장축제',
        271: '광주 버스킹 월드컵',
        272: '비어 페스트 광주',
        273: '응봉산 해맞이 축제',
        274: '2022 대한민국 소극장 열전 in 춘천',
        275: '제20회 담안골 문화축제',
        276: '장산제',
        277: '제11회 재송포축제',
        278: '동백섬문화관광축제',
        279: '제10회 수영강변축제',
        280: '제18회 부산불꽃축제',
        281: '제10회 해운대 빛축제',
        282: '제36회 해운대북극곰축제',
        283: '2024 카운트다운&해맞이 축제',
        284: '제16회 마포나루 새우젓축제',
        285: '신년해맞이축제',
        286: '2023 금정산성축제',
        287: '2023 지금여기 금정 관광후기 이벤트',
        288: '고싸움놀이축제',
        289: '서창만드리풍년제',
        290: '역세권 싱싱포차 축제',
        291: '경산갓바위소원성취축제',
        292: '천안흥타령춤축제',
        293: '입장거봉포도축제',
        294: '천안성환배축제',
        295: '천안호두축제',
        296: '고창모양성제',
        297: '한여름밤의 남원 막걸리 축제',
        298: '동동동화축제',
        299: '2023 해운대카운트다운&해맞이축제',
        300: '제38회 해운대 달맞이온천축제',
        301: '제18회 해운대 모래축제',
        302: '제18회 국제매직페스티벌',
        303: '제7회 반송한마음축제',
        304: '제27회 부산바다축제',
        305: '송정해변축제',
        306: '달맞이언덕 인문학 축제',
        307: '팔봉산 감자축제',
        308: '(코로나로 일정 미정)서산6쪽마늘축제',
        309: '삼길포우럭축제',
        310: '서산해미읍성축제',
        311: '나비대축제',
        312: '다문화 한글 백일장',
        313: '다문화축제',
        314: '두근두근페스티벌',
        315: '장미꽃 필(feel)무렵',
        316: '희망달서 큰잔치',
        317: '선사문화체험축제',
        318: '제4회 연제고분판타지축제',
        319: '합천벚꽃마라톤대회',
        320: '제11회 서면메디컬스트리트 축제',
        321: '예산장터삼국축제',
        322: '의좋은형제축제',
        323: '윤봉길평화축제',
        324: '예산황토사과축제',
        325: '정월대보름 축제',
        326: '도구로 벚꽃축제',
        327: '반포서래 한불음악축제',
        328: '2022 마임아카데미 몸짓워크숍',
        329: '2022 양산삽량문화축전',
        330: '제6회_회령포_문화축제',
        331: '완주와일드앤로컬푸드축제',
        332: '2023청도소싸움축제',
        333: '제15회 청도유등제',
        334: '2023청도반시축제',
        335: '2023청도세계코미디아트페스티벌',
        336: '장수 한우랑 사과랑 축제',
        337: '도봉서원 춘·추향제',
        338: '도봉산 산사축제',
        339: '도봉구민 건강축제',
        340: '2023 서귀포문화재 야행',
        341: '제주 기상 100주년 기념 문화제',
        342: '제주도민과 함께하는 공군음악회',
        343: '제주잇(eat)수다',
        344: '2023년 원도심 <하하페스티벌>',
        345: '머체왓레스토랑',
        346: '한림공원 튤립축제',
        347: '2023 귀리 전통문화축제',
        348: 'JSW SPRING BREEZE CONCERT',
        349: '2023 제주카페스타',
        350: '한림공원 부겐빌레아축제',
        351: '제10회 국제전기자동차엑스포',
        352: '제3회 웰니스 숲힐링 축제 - 숲 상상 그 이상의 미래',
        353: 'SUMMER CAMP',
        354: '제주민속촌 야간개장 귀몽',
        355: '새연교 콘서트',
        356: '괴산대학찰옥수수축제',
        357: '괴산고추축제',
        358: '괴산김장축제',
        359: '감물감자축제',
        360: '괴산사랑축제',
        361: '목도 백중놀이 축제',
        362: '文美貪',
        363: 'Your Body',
        364: '마임프린지',
        365: '제7회 도심 속 바다축제',
        366: '도봉산 산사축제',
        367: '도봉구민 건강축제',
        368: '2023 수원음식문화박람회',
        369: '둔내고랭지토마토축제',
        370: '횡성더덕축제',
        371: '안흥찐빵축제',
        372: '횡성한우축제',
        373: '횡성호수길축제',
        374: '횡성회다지소리축제',
        375: '달서 맛 페스티벌',
        376: '달서 맛 페스티벌',
        377: '달서 맛 페스티벌',
        378: '도봉 과학축전',
        379: '도봉구 등축제',
        380: '순창장류축제',
        381: '2022 정원예술제',
        382: '골목이 들썩들썩 마을축제',
        383: '제39회 순천팔마문화제',
        384: '생태문화축제',
        385: '2022 순천 푸드앤아트페스티벌',
        386: '제27회 낙안읍성 민속문화축제',
        387: '전국 발효식품 홍보대전',
        388: '순천웹툰페스티벌',
        389: '(코로나로 일정 미정)해미벚꽃축제',
        390: '(코로나로 일정 미정)지곡 왕산포 서산갯마을축제',
        391: '류방택 별축제',
        392: '상패남산축제',
        393: '동두천시 자원봉사 축제',
        394: 'DDC할로윈클럽데이',
        395: '제1회 대청호 벚꽃축제',
        396: '2023 정조대왕 능행차 공동재현',
        397: '제60회 수원화성문화제',
        398: '2023 세계유산축전 수원화성',
        399: '2023 수원화성 미디어아트',
        400: '연극 통일 익스프레스',
        401: '창작뮤지컬 흰 사과나무',
        402: '춘천아트페스티벌',
        403: '2020춘천조각공공미술심포지엄',
        404: '슬기로운 협동생활',
        405: '강원문화재단요선시장 코로나땡 동그랑땡',
        406: '배내골고로쇠축제',
        407: '원동매화축제',
        408: '양산시청소년한마음축제',
        409: '2022 양산 월드 힙합 어벤져스',
        410: '2022 양산웅상회야제',
        411: '어린이날 가족한마당',
        412: '제5회 인제가을꽃축제',
        413: '치악산왕발걸음축제',
        414: '제25회 원주한지문화제',
        415: '제16회 용수골꽃양귀비축제',
        416: '제21회 장미축제',
        417: '제13회 남한강축제',
        418: '치악산찰옥수수축제',
        419: '치악산복숭아축제',
        420: '2023 원주 댄싱카니발',
        421: '구미한가위 전통연희축제',
        422: '단기4355년 개천절 대제전',
        423: '단기4355년 어천절 대제전',
        424: '2022 종로한복축제',
        425: '제28회 오리문화제',
        426: '제29회 오리문화제',
        427: '농악대축제',
        428: '아트밸리 아산 제2회 공연예술제',
        429: '아트밸리 아산 제1회 국제민족무용대회',
        430: '아트밸리 아산 제5회 전국 주부가요제',
        431: '아트밸리 아산 제1회 아산온천 벚꽃축제',
        432: '설화예술제',
        433: '아트밸리 아산 제1회 외국인 K-트롯 가요제',
        434: '아트밸리 아산 재즈Festa',
        435: '뮤지컬 순회공연(영웅)',
        436: '지식정보화시대 책이 밥 먹여 주는 시대',
        437: '2021 강원도민 연극교실 금쪽같은 우리엄빠 참여자 모집',
        438: '2021 정책아카데미 청년정책기획자 양성 과정 참여자 모집 안내',
        439: '창조성워크샵 creativity',
        440: '재춘천인형극제_2021 콘텐츠 창의인재 동반 사업_공연예술의 저작권관련법',
        441: '한국저작권위원회 2021년 11월 무료 온라인 교육 안내',
        442: '2021 상상언더 청소년 교육생 모집밴드 댄스',
        443: '춘천인형극제 문화예술교육사 실습처 문화예술 장르의 결합과 현장실습',
        444: '2021 청년청 일자리 지원사업 글로벌기업취업JOB GO 시즌2 모집안내',
        445: '춘천시 청년청 청춘클라스 3차 네트워킹데이 춘천의 길 투어프로그램',
        446: '홍라무와 함께하는 몸시 워크샵',
        447: '한국관광공사 2021 공연관광 마케팅 아카데미_사전모집',
        448: '통합문화예술교육프로그램 나와 만나는 예술 속 몸 짓 손 짓',
        449: '2021 강원도립극단 배우술훈련',
        450: '달콤한 잠A Sweet Slumber',
        451: '2020 강원민족예술한마당 끽해야 한판',
        452: '뮤지컬 루나틱',
        453: '동작가족한마음축제',
        454: '2022링크전-○△□',
        455: '2022 서현종 개인전',
        456: '제19회 겸로 이형제 개인전 봄내의 골목길-어제와 오늘',
        457: '강원대학교 산학협력단 K-Digital Training 제2기 교육생 모집',
        458: '구름산예술제',
        459: '자연과 영혼을 담은 구자근展',
        460: '한동국 현관문',
        461: '2022 춘천학 학술대회 댐과 춘천의 미래',
        462: '할말하않 황효창展',
        463: '힘찬 제왕수탉_ 제왕수탉 힘찬울림 Coq-imperial Powerful sound',
        464: '유관선 사진전- 해빙',
        465: '길창인 개인전 - 회귀',
        466: '춘천여성미술작가회『만화방창』展',
        467: '제2회 춘천 국제 어린이 그림 교류전',
        468: '애니메이션박물관 제17회 기획전 세상을 바꾼 불꽃 태일이',
        469: '개나리미술관 신진작가공모 선정작가전-최인엽',
        470: 'Re Birth - 다시 삶으로',
        471: '2022 KT&G 상상마당 춘천 아트갤러리 정기대관 공고',
        472: '만나고 싶었습니다 창작의 자극 그리고 예술로 환기',
        473: '동작구 도서관 축제',
        474: '순천 문화재 야행',
        475: '창원단감축제',
        476: '마산아구데이축제',
        477: '창원K-POP월드페스티벌',
        478: '대관령눈꽃축제',
        479: '여수동동북축제',
        480: '청년거리문화축제',
        481: '2023 노원달빛산책',
        482: '제24회음성품바축제',
        483: '제42회설성문화제',
        484: '임실N치즈축제',
        485: '서산해미읍성축제',
        486: '수원화성문화제',
        487: '연천구석기축제',
        488: '대전효문화뿌리축제',
        489: '진주남강유등축제',
        490: '강경젓갈축제',
        491: '광주 추억의 충장축제',
        492: '울산고래축제',
        493: '목포항구축제',
        494: '고창갯벌축제',
        495: '무장읍성축제',
        496: '고창해풍고추축제',
        497: '동두천 무형문화재 축제',
        498: '왕방산 국제MTB대회',
        499: '천사마라톤대회',
        500: '동두천 청소년 별자리과학 축제',
        501: '동두천락페스티벌',
        502: '2022 제6회 이담농악두드림대축제',
        503: '제4회 동두천 국제 트레일러닝 대회',
        504: '2023년 고운달 마을사랑 대잔치',
        505: '제5회 신정1동 마을축제',
        506: '김천 하늘여행 열기구 페스티벌',
        507: '캠핑페스티벌',
        508: '팜앤컬쳐페스타(농촌체험페스티벌)',
        509: '2023 대전 서구힐링 아트페스티벌',
        510: '홍성역사인물축제',
        511: '글로벌바비큐페스티벌 in 홍성',
        512: '홍성남당항 새조개축제',
        513: '강원도립극단 우리가족 본격 소통 공감 연극 놀이터 금쪽같은 우리 엄빠',
        514: '자연이 주는 선물_신동필 사진전',
        515: '가정식 백반 맛있게 먹는 법',
        516: '2022 도시재생 청소년 메이커스쿨',
        517: '연극 소낙비처우',
        518: '무하 MOOHA SPACE OF YANGYANG',
        519: 'Connect musical',
        520: '제2회 春川共感展_춘천공감전',
        521: '2022 춘천예술문화축제',
        522: '시민과 함께하는 라이브러리 치유 콘서트',
        523: '2022 춘천오페라페스티발 카르멘',
        524: '2022 강원콘텐츠코리아랩 창작공모전',
        525: '2020 동작복지나눔축제',
        526: '어린이 창작무용극 갓깨비',
        527: '2022 실레페스트Sille Fest 강원 국제 아마추어 연극제',
        528: '영서기획- Work&Art Balance',
        529: 'still a cat',
        530: '한선주展_Dearest Yoricke 친애하는 요릭에게',
        531: '제27회 무주반딧불축제',
        532: '제39회 단양소백산철죽제',
        533: '광주왕실도자기축제',
        534: '2023 유성재즈 맥주페스타',
        535: '구미 푸드페스티벌',
        536: '구미 독서문화 축제',
        537: '비산나루터 문화축제',
        538: '구미 라면축제',
        539: '제21회 부여서동연꽃축제',
        540: '2023 백제문화제',
        541: '태백산 눈축제',
        542: '김덕림 개인전 나를 사랑한 색 - 어울림의 빛을 나누다',
        543: '윤운복 개인전 Remember60展',
        544: '제34회 춘천인형극제 코코바우 스테이지 12월 기획공연',
        545: '강원도립극단 뮤지컬 무궁화 꽃이 피었습니다',
        546: '지유선 개인전 무지개 터널에서 만나',
        547: 'The Frame',
        548: '해를 낚은 할아버지',
        549: '소프라노 이효영 귀국 독창회',
        550: '연극 금따는 콩밭',
        551: '창작국악뮤지컬 어라연 연가',
        552: '마스터클래스 23회차 영혼의 기타리스트 이근형 vs 괴물연주자 베이시스트 장태웅',
        553: '하녀들',
        554: '송연교의 춤 카르마 業',
        555: '안형국 Dance Company 틀 무용 자유일기',
        556: '음악극 브릴리언트-찬란하게 빛나던',
        557: '종합예술극 라임의 왕 김삿갓',
        558: '강우성의 피아노 독주회 8 두 사람의 여정',
        559: '공주 석장리 구석기축제',
        560: '계룡산산신제',
        561: '세종축제',
        562: '보수동책방골목문화축제',
        563: '부산국제영화제 전야제',
        564: '부산자갈치축제',
        565: '광복로겨울빛트리축제',
        566: '제21회 옥천묘목축제',
        567: '제14회 옥천참옻축제',
        568: '제15회 향수옥천 포도·복숭아 축제',
        569: '제36회 지용제',
        570: '제1회 향수옥천 유채꽃축제',
        571: '2019 안양 시민축제',
        572: '2021 안양시민축제 <우선멈춤>',
        573: '2022 안양시민축제 <우선멈춤>',
        574: '2023 안양충훈벚꽃축제',
        575: '2023 광복78주년 광복기념음악회',
        576: '2023 안양춤축제 ANYANG DANCE FESTIVAL',
        577: '평창송어축제',
        578: '대관령눈꽃축제',
        579: '오대산문화축전',
        580: '계촌클래식축제',
        581: '평창효석문화제',
        582: '평창백일홍축제',
        583: '평창농악축제',
        584: '(23년미정)하남이성산성문화축제',
        585: '제50회 지리산평화제',
        586: '제47회 남명선비문화축제',
        587: '제17회 기산국악제전',
        588: '제15회 불교문화제전',
        589: 'The 4th Exhibition 2022 김운연의 Harmony-Breathe 숨쉬다',
        590: '김영경 개인전 사이의 공간',
        591: '강선주 개인전 정원도감-치유의 정원 으로의 초대',
        592: 'Edu오케스트라 창단연주회',
        593: '하림 권매화 개인전 내일을 꿈꾸다',
        594: '결 로 사진작가 이내 개인전',
        595: '보드게임 디자인 워크숍 - 나만의 보드게임 만들기',
        596: '2022 작은 무대에 부는 바람 in 춘천',
        597: '김동일의 다큐멘터리 댄스 프로젝트 얼굴등등',
        598: '조정태 갈림길을 지나며 Passing the crossroads',
        599: '해와 달을 삼킨 소양강',
        600: '제61회 춘천미술협회전 전통의 재해석춘천문화예술회관',
        601: '리차드 로의 재즈톡',
        602: '나 때는 말이야',
        603: '힐링 개그 콘서트',
        604: '오페라 팝페라 뽕페라',
        605: '박강수콘서트',
        606: '대왕암 해맞이 축제',
        607: '퓨전 국악의 향연',
        608: '제16회_정남진_장흥_물축제',
        609: '청천환경버섯축제',
        610: '사리면빨 축제',
        611: '양곡은행나무축제',
        612: '농악대축제',
        613: '농악대축제',
        614: '구름산예술제',
        615: '제14회 광명시평생학습축제',
        616: '제2회 밤일음식문화 거리 축제',
        617: '구름산예술제',
        618: '제16회 광명시평생학습축제',
        619: '제26회 오리문화제',
        620: '창원진동불꽃낙화축제',
        621: '야철제',
        622: '마산만날제',
        623: '남산상봉제',
        624: '창원음식문화축제',
        625: '2022 청춘의회 제3기 청년의원',
        626: '음악으로 지역을 잇다 뮤지컬 @춘천 참가자 모집',
        627: '2022 춘천공연예술제',
        628: '2022 춘천연극제',
        629: '제18회 광릉숲축제',
        630: '오구오구 어린이 버스킹',
        631: '한여름 밤의 숲속 음악회',
        632: '제21회 허준축제',
        633: '안성맞춤 남사당 바우덕이 축제',
        634: '안성맞춤 포도축제',
        635: '죽주대고려문화축제',
        636: '제21회어방축제',
        637: '제19회 구리 유채꽃 축제',
        638: '제19회 구리 코스모스 축제',
        639: '2023 구리 유채꽃 한강예술제',
        640: '제4회 홍제1동 장미거리축제',
        641: '2023 대구앞산축제(제28회 대덕제)',
        642: '자라섬 국제재즈페스티벌',
        643: '속리산 신화여행축제',
        644: '논두렁밭두렁축제',
        645: '수성못페스티벌',
        646: '장미꽃 필 무렵',
        647: '달성 100대 피아노',
        648: '음악극 동백꽃',
        649: 'Re Birth - 다시 삶으로',
        650: '연극 알자스 지방의 세입자',
        651: 'book book book 생각나누기 즐겁게 책읽기 특강 및 멘토링',
        652: '시민이 상상한 옥상 현실이 되다 옥상상상',
        653: '마켓396',
        654: '2023년 개화산 해맞이행사',
        655: '2023년 개화산 봄꽃축제',
        656: '2023년 마곡문화의 거리 버스킹',
        657: '제7회 겸재문화예술제',
        658: '2023년 우장산 신록 페스티벌',
        659: '강서문화예술페스티벌',
        660: '이형석 개인전 그것들은 다 옷같이 낡으리니',
        661: '춘천의 겨울을 마주하다_황순란',
        662: '도봉구 등축제',
        663: '정의공주와 함께 하는 도봉 한글잔치',
        664: '정월대보름 큰잔치',
        665: '영암왕인문화축제',
        666: '제10회 낙동강 구포나루 축제',
        667: '금산인삼축제',
        668: '금산삼계탕축제',
        669: '2023 부소산 봄 나들이 축제',
        670: '마산국화축제',
        671: '정의공주와 함께 하는 도봉 한글잔치',
        672: '정월대보름 큰잔치',
        673: '도봉서원 춘·추향제',
        674: '대한민국 국향대전',
        675: '고성군민의 날 및 수성문화제',
        676: '백제 어울마당',
        677: '웅진성수문병 근무교대식',
        678: '부산고등어축제',
        679: '평창송어축제',
        680: '제17회 순천명품월등복숭아 축제',
        681: '마켓396 6월X 커넥티드스몰마켓 in chuncheon',
        682: '강원도립무용단 창작무용극 강호',
        683: '가야문화축제(예정)',
        684: '김해분청도자기축제',
        685: '김해평생학습과학축제',
        686: '아트밸리 아산 제62회 성웅 이순신 축제',
        687: '제13회 양평 용문산 산나물축제',
        688: '제13회 양평 용문산 산나물축제',
        689: '제4회 양평부추축제',
        690: '낙동강유채꽃축제',
        691: '부산원도심골목길축제',
        692: '부산시민의종 타종식',
        693: '부산국제록페스티벌',
        694: '부산불꽃축제',
        695: '부산바다축제',
        696: '이천도자기축제',
        697: '대구화교중화문화축제',
        698: '봉산미술제',
        699: '종로맛길축제',
        700: '용암산성 옥샘문화제',
        701: '팔공산 단풍축제',
        702: '달구벌목민관축제',
        703: '대덕제 대구앞산축제',
        704: '신천 음악버스킹',
        705: '대구할로윈축제',
        706: '금호강바람소리길축제',
        707: '저전동 상가골목축제',
        708: '도시농업 어울림 한마당',
        709: '2022 순천만국가정원 정원야행(夜行)',
        710: '제7회 순천미식대첩',
        711: '몽미락 거리 축제',
        712: '둔내고랭지토마토축제',
        713: '횡성더덕축제',
        714: '안흥찐빵축제',
        715: '횡성한우축제',
        716: '2022 영동곶감축제',
        717: '2022 영동포도축제',
        718: '제53회 영동난계국악축제',
        719: '제11회 대한민국와인축제',
        720: '김광석길 페스티벌',
        721: '서문시장글로벌대축제',
        722: '교동시장한마음축제',
        723: '빨간구두이야기',
        724: '대구화교중화문화축제',
        725: '대구화교중화문화축제',
        726: '대구화교중화문화축제',
        727: '대구화교중화문화축제',
        728: '중구미술협회전',
        729: '중구미술협회전',
        730: '중구미술협회전',
        731: '제1회남대천벚꽃축제',
        732: '2023년 거창한마당대축제',
        733: '법성포단오제',
        734: '불갑산상사화축제',
        735: '강원도립극단 기획공연 뮤지컬 무궁화 꽃이 피었습니다',
        736: '엘사의 생일파티',
        737: '강원예총 60주년 문화예술대축제 공감음악회',
        738: '2022년 대한민국의 새로운 민요지형도 덩기두밥 프로젝트',
        739: '제3회 호반음악제-어느 여름날',
        740: '춘천 라틴 뮤직 페스타 춤 추어라 호반아',
        741: '춘천리조이스힐링 페스티벌',
        742: '2022 차근차근 상영전',
        743: '2022 리얼노상댄스펍',
        744: '제20회 춘천국제고음악제',
        745: '2022 춘천 색소폰 페스티벌 & 춘천 아마추어 색소폰 경연대회',
        746: '2022 춘천 반려동물 동행 페스티벌',
        747: '춘천인형극제',
        748: '새명동 상권 축제 시청광장에 어린이들 모여라 어린이 행사 반짝 놀이터',
        749: '마켓396 8월NIGHT MARKET',
        750: '제19회 춘천전국관악경연대회',
        751: '민속그네뛰기',
        752: '달맞이축제',
        753: '태하성하신당제',
        754: '회당문화축제',
        755: '해변가요제',
        756: '울릉도오징어축제',
        757: '신시모도삼형제보물섬축제',
        758: '제23회 밀양공연예술축제',
        759: '제27회 대한민국 청소년연극제',
        760: '단종문화제',
        761: '동강국제사진제',
        762: '영월동강뗏목축제',
        763: '2017 안양 아줌마축제',
        764: '2017 광복기념음악회',
        765: '연산대추문화축제',
        766: '2017 안양 시민축제',
        767: '2018 안양충훈벚꽃축제',
        768: '2018 안양여성축제',
        769: '2018 광복기념음악회',
        770: '2018 안양 시민축제',
        771: '직지문화제',
        772: '청원생명축제',
        773: '세종대왕과 초정약수 축제',
        774: '고흥 우주항공 축제',
        775: '강진금곡사벚꽃삼십리길축제',
        776: '현인가요제',
        777: '동성로축제',
        778: '동성로축제',
        779: '제31회 동성로축제',
        780: '제32회 동성로축제',
        781: '제33회 동성로축제',
        782: '제34회 동성로축제',
        783: '대구화교중화문화축제',
        784: '대구화교중화문화축제',
        785: '대구화교중화문화축제',
        786: '대구화교중화문화축제',
        787: '대구화교중화문화축제',
        788: '대구스트리트모터페스티벌',
        789: '대구문화재야행',
        790: '김광석 나의노래 다시부르기',
        791: '순천시 책 축제',
        792: '문화놀이터 축제',
        793: '진해군악의장페스티벌',
        794: '김삿갓문화제',
        795: '2016 대가야체험축제',
        796: '삼척종합예술제',
        797: '삼척민족예술제',
        798: '삼수 매봉산 바람개비 축제',
        799: '장성탄탄축제활기찬동행',
        800: '태백 황지연못 황부자며느리 축제',
        801: '철암 단풍축제',
        802: '태백산 눈축제',
        803: '강릉단오제',
        804: '도솔산지구전투 전승행사',
        805: '양록제',
        806: '양구배꼽축제',
        807: '지리산 바래봉 눈꽃축제',
        808: '지리산 뱀사골 고로쇠 약수제',
        809: '제93회 춘향제',
        810: '지리산 바래봉 철쭉제',
        811: '봉화산 철쭉제',
        812: '흥부제',
        813: '지리산 뱀사골 단풍제',
        814: '동성로축제',
        815: '진안홍삼축제',
        816: '광주 서창 억새축제',
        817: '강릉커피축제',
        818: '세종축제',
        819: '철원 DMZ 평화 꽃송이 축제',
        820: 'DMZ피스트레인 뮤직 페스티벌',
        821: '선암매화제',
        822: '제8회 낙안읍성 전국 국악대전',
        823: '정선아리랑제',
        824: '제2회 대청호 벚꽃축제',
        825: '제3회 대청호 벚꽃축제',
        826: '제4회 대청호 벚꽃축제',
        827: '제5회 대청호 벚꽃축제',
        828: '동성로축제',
        829: '동성로축제',
        830: '동성로축제',
        831: '동성로축제',
        832: '동성로축제',
        833: '동성로축제',
        834: '동성로축제',
        835: '2023년 제5회 운정호수공원불꽃축제',
        836: '물의 감정 In The Mood For Water',
        837: '조운플레잉',
        838: '개나리아트페어2022',
        839: '왜목마을해넘이해맞이축제',
        840: '대봉웨딩거리축제',
        841: '해나루황토고구마홍보행사',
        842: '해나루쌀농특산물홍보행사',
        843: '용인어린이상상의숲 어린이 주간 특별 행사 <오, 오 상상이상>',
        844: '처인성문화제',
        845: '한 여름밤의 음악회(2023 의령사랑 Summer Festival)',
        846: '국악의 향연',
        847: '포항거리예술축제',
        848: '제8회 철원 한탄강 얼음트레킹',
        849: '제13회 철원 화강 다슬기축제',
        850: '2019 송년콘서트 및 청소년페스티벌',
        851: '진해군항제',
        852: '2022 보은대추축제',
        853: '기지시줄다리기민속축제',
        854: '순성매화벚꽃축제',
        855: '장고항실치마을수산물홍보행사',
        856: '한진포구바지락갯벌체험축제',
        857: '순성왕매실&당진맥주 축제',
        858: '당진합덕연꽃축제',
        859: '삽교호조개구이축제',
        860: '심훈상록문화제',
        861: '남이흥장군문화제',
        862: '2023 제11회 군산시간여행축제',
        863: '강경젓갈축제',
        864: '제7회 전포커피축제',
        865: '부산진구 서면 빛축제',
        866: '불광천 축제',
        867: '세종조치원복숭아축제',
        868: '금강보행교 거점공연',
        869: '금강청소년축제',
        870: '3회 금남면 강변벚꽃십리길 축제',
        871: '면천진달래민속축제(취소)',
        872: '춘천마임축제 걷다 보는 마임',
        873: '제 29회 봄내예술제 봄내미술인전_시민과 예술인의 만남',
        874: '2023 마임아카데미 실행 워크숍',
        875: '보물섬 남해 갈화왕새우 특판행사',
        876: '제11회 독일마을 맥주축제',
        877: '보물섬 남해 커피축제',
        878: '다랭이마을 해맞이 행사',
        879: '상주해돋이&물메기 축제',
        880: '제천국제음악영화제',
        881: '제천의병제',
        882: '강서 낙동강30리 벚꽃축제(2023년)',
        883: '봉화은어축제',
        884: '봉화송이축제',
        885: '제6회의성슈퍼푸드마늘축제',
        886: '팔공산 산중장터 승시',
        887: '대구생활문화제',
        888: '대구패션주얼리위크',
        889: '땅끝 해넘이·해맞이 축제',
        890: '김삿갓문화제',
        891: '구문소용축제',
        892: '황연 기차화통 축제',
        893: '한강 낙동강 발원지 축제',
        894: '삼수 매봉산 바람개비 축제',
        895: '장성 탄탄마을 축제',
        896: '탐라국 입춘굿',
        897: '거리예술제',
        898: '거리예술제',
        899: '용연음악회',
        900: '한여름밤의 예술공연',
        901: '아트페스타인제주',
        902: '해맞이 행사',
        903: '금호강 정월대보름축제',
        904: '금호강 바람소리길축제',
        905: '대구 북구 떡볶이 페스티벌',
        906: '대구글로벌게임문화축제 e-fun',
        907: '생명사랑환경축제-맹꽁이야 놀자',
        908: '대구국제재즈축제',
        909: '명량대첩축제',
        910: '북평용줄다리기 축제',
        911: '해남미남축제',
        912: '태백 커플축제',
        913: '한강 낙동강 발원지 축제',
        914: '대한민국 마한문화제',
        915: '천년나주목읍성문화축제',
        916: '마임프린지 시민 심사단 모집',
        917: '2022 물금 벚꽃 축제',
        918: '2022 양산봄꽃축제',
        919: '원동미나리축제',
        920: '계촌클래식축제',
        921: '평창효석문화제',
        922: '평창백일홍축제',
        923: '평창농악축제',
        924: '안동국제탈춤축제',
        925: '대구치맥페스티벌',
        926: '디지털패션문화페스티벌',
        927: '대구포크페스티벌',
        928: '대구국제오페라축제',
        929: '용인 청년 문화 축제 <2022 아트로드>',
        930: '용인어린이상상의숲 가을특별행사 온 가족이 함께하는 <상상북크닉>',
        931: '할미성 대동제',
        932: '포은문화제',
        933: '정선아리랑제',
        934: '천만송이 국화축제',
        935: '고성군민의 날 및 수성문화제',
        936: '2023 계묘년 해맞이행사',
        937: '2023 정월대보름 달맞이축제',
        938: '제25회 UN평화축제',
        939: '청남대 재즈토닉페스티벌',
        940: '청남대 영춘제',
        941: '청주읍성큰잔치',
        942: '청원생명축제',
        943: '세종대왕과 초정약수축제',
        944: '충주 다이브(DIVE) 페스티벌',
        945: '제51회 우륵문화제',
        946: '청풍호 벚꽃축제',
        947: '겨울왕국제천 페스티벌',
        948: '대구약령시한방문화축제',
        949: '대구컬러풀페스티벌',
        950: '대구국제뮤지컬페스티벌',
        951: '2017 물의나라화천 쪽배축제',
        952: '2017 얼음나라화천 산천어축제',
        953: '구문소용축제',
        954: '2021조운플레잉 모두가어린이라면',
        955: '책 보러 가지 않을래',
        956: '춘천마임축제 봄시즌',
        957: '춘천인형극제 코코바우 놀이터 자연아 놀러와',
        958: '제8회 철원 한탄강 얼음트레킹',
        959: '제13회 철원 화강 다슬기축제',
        960: '2019 송년콘서트 및 청소년페스티벌',
        961: '2016 제5회 안양공공예술프로젝트',
        962: '2014 안양시민축제',
        963: '2017 안양충훈벚꽃축제',
        964: '달마고도 힐링축제',
        965: '땅끝수국축제',
        966: '송호해변여름축제',
        967: '오시아노 썸머뮤직 페스티벌',
        968: '제3기 청년기자단 모집',
        969: '상설전 畵',
        970: '뉴웨이브 로컬 임팩트 아카데미',
        971: '달맞이축제',
        972: '제27회 부천국제판타스틱영화제',
        973: '여름꽃 이야기 비체올린 능소화 축제',
        974: '보롬왓 축제',
        975: '2023 제주 요가 페스티벌',
        976: '세상에 이런(E-RUN) 트립 in 우도',
        977: '2023 세계인제주 외국인 커뮤니티 제전',
        978: '제주오라 메밀유채꽃축제',
        979: '의령 홍의장군축제',
        980: '의령 리치리치 페스티벌',
        981: '의령 신번문화축제',
        982: '홍성남당항 대하축제',
        983: '광천김토굴새우젓 대축제',
        984: '홍성사랑국화축제',
        985: '홍성남당항 바다송어축제',
        986: '제24회 양평단월고로쇠축제',
        987: '제20회 양평산수유한우축제',
        988: '2023 G컬처페스타',
        989: '마노르블랑 수국축제',
        990: '플리마켓 <신화愛퐁당>',
        991: 'LASP X 신라 : 공간과 순간이 만나 예술이 되다',
        992: '구팔일 올데이페스티벌',
        993: '삼다공원 야간콘서트',
        994: '2023 필터 페스티벌(Filter Festival)',
        995: '2023 컬러풀 산지(Colorful SANJI) 페스티벌',
        996: '여수영취산진달래체험행사',
        997: '여수거북선축제',
        998: '여수여자만갯벌노을체험행사',
        999: '거문도백도은빛바다체험행사',
        1000: '여수밤바다 불꽃축제',
        1001: '여수향일암일출기원한마당',
        1002: '여르미오페스티벌',
        1003: '여르미오페스티벌',
        1004: '여르미오페스티벌',
        1005: '안산국제거리극축제',
        1006: '2017 물의나라화천 쪽배축제',
        1007: '2017 얼음나라화천 산천어축제',
        1008: '섬 수선화 축제',
        1009: '섬 튤립축제',
        1010: '전국 새우란 축제',
        1011: '흑산홍어축제',
        1012: '치악산한우축제',
        1013: '원주 독서대전',
        1014: '원주 평생학습 축제',
        1015: '치악산배축제',
        1016: '반계리 은행나무축제',
        1017: '제23회 섬강축제',
        1018: '철원 DMZ 평화 꽃송이 축제',
        1019: 'DMZ피스트레인 뮤직 페스티벌',
        1020: '에코아트페어 제로섬씽Zero-Somthing 2023',
        1021: '2023춘천예술문화축제 - 제10회 한여름밤의 아리아',
        1022: '2023 춘천공연예술제',
        1023: '2023 춘천연극제',
        1024: '2023 춘천오페라페스티발',
        1025: '마임프린지',
        1026: '마임프린지 시민 심사단 모집',
        1027: '2022 마임아카데미 몸짓워크숍',
        1028: '춘천마임축제 봄시즌',
        1029: '평창송어축제',
        1030: '원주댄싱카니발',
        1031: '소래포구축제',
        1032: '탐라문화제',
        1033: '대구약령시 한방문화축제',
        1034: '영동난계국악축제',
        1035: '군산시간여행축제',
        1036: '양지암축제',
        1037: '거제 섬꽃축제',
        1038: '거제대구수산물축제',
        1039: '거제송년불꽃축제',
        1040: '2023 과천공연예술축제',
        1041: '양천구 해우리문화축제 <바람난 양천>',
        1042: '2022 양천 창의교육 축제 X 과학체험한마당',
        1043: '2022년 제6회 파리공원문화축제',
        1044: '제3회 능골산문화축제',
        1045: '2023년 제5회 등마루축제',
        1046: '2023년 제7회 파리공원문화축제',
        1047: '목2동 용왕산 달빛거리 축제',
        1048: '김제지평선축제',
        1049: '부평풍물대축제',
        1050: '안동국제탈춤축제',
        1051: '강진청자축제',
        1052: '안성맞춤 남사당 바우덕이축제',
        1053: '부천국제만화축제',
        1054: '풍기인삼축제',
        1055: '산청한방약초축제',
        1056: '양양송이축제',
        1057: '울산옹기축제',
        1058: '금산세계인삼축제',
        1059: '2023 음성명작페스티벌',
        1060: '횡성한우축제',
        1061: '미추홀미디어문화축제',
        1062: '연천구석기축제',
        1063: '2016 광복기념음악회',
        1064: '2014 안양 아줌마축제',
        1065: '2015 안양 시민축제',
        1066: '2015 안양 아줌마축제',
        1067: '2016 안양 시민축제',
        1068: '2016 안양 아줌마축제',
        1069: '담양대나무축제',
        1070: '담양산타축제',
        1071: '추월산벚꽃축제',
        1072: '창평전통음식문화축제',
        1073: '가로수사랑음악회',
        1074: '고서포도축제',
        1075: '춘장대해수욕장 여름문화예술축제',
        1076: '자연산 광어.도미 축제',
        1077: '마량포 해넘이.해돋이 축제',
        1078: '홍원항 자연산 전어.꽃게 축제',
        1079: '한산모시문화제',
        1080: '서천철새여행',
        1081: '서천군 동백꽃 주꾸미 축제',
        1082: '2023 GIG Festival',
        1083: '2023 어린이동화페스티벌',
        1084: '2023 관악강감찬축제',
        1085: '제19회 진안고원 운장산 고로쇠축제',
        1086: '제13회 진안고원 수박축제',
        1087: '2023 진안홍삼축제',
        1088: '제5회 진안고원 가족공동체 김장문화축제',
        1089: '2023 마이산 겨울동화축제',
        1090: '제20회 사상강변축제',
        1091: '사하예술제',
        1092: '2023 청양고추구기자 축제',
        1093: '제24회 칠갑산장승문화축제',
        1094: '만드리풍년제',
        1095: '광주서창억새축제',
        1096: '영도다리축제',
        1097: '영도커피페스티벌',
        1098: '2023 통영한산대첩축제',
        1099: '보은대추축제',
        1100: '제36회 지용제',
        1101: '영동곶감축제',
        1102: '영동포도축제',
        1103: '제54회 영동난계국악축제',
        1104: '제12회 대한민국와인축제',
        1105: '증평들노래축제',
        1106: '증평인삼골축제',
        1107: '제23회 생거진천 농다리축제',
        1108: '괴산고추축제',
        1109: '제24회 음성품바축제',
        1110: '제42회 설성문화제',
        1111: '제38회 소백산철쭉제',
        1112: '제27회 제주국제관광마라톤축제',
        1113: '2023 서귀포 유채꽃축제',
        1114: '제12회 우도소라축제',
        1115: '한라산청정고사리축제',
        1116: '가파도청보리축제',
        1117: '강정마을 생태축제',
        1118: '제주MBC 국제평화마라톤',
        1119: '2023 제주 고산리 유적 선사축제',
        1120: '휴애리 유채꽃 축제',
        1121: '한림공원 수선화축제',
        1122: '탐라국입춘굿',
        1123: '휴애리 매화축제',
        1124: '한림공원 매화축제',
        1125: '상효원수목원 튤립축제',
        1126: '한림공원 왕벚꽃축제',
        1127: '마노르블랑 봄꽃축제',
        1128: '제주허브동산 설유화 축제',
        1129: '휴애리 봄 수국축제',
        1130: '빛의 벙커 ’세잔프로방스의빛/칸딘스키’ 전',
        1131: '친환경 그래비티 레이싱 : 23시즌 정규 라운드(9.81파크)',
        1132: '제주 다이노스 어라이브 <JEJU DINOS ALIVE>',
        1133: '제8회 사천비토섬별주부전축제',
        1134: '제25회 사천와룡문화제',
        1135: '선진리성벚꽃축제',
        1136: '사천읍성 문화축제',
        1137: '사천예술제',
        1138: '평창효석문화제',
        1139: '정선아리랑제',
        1140: '화성뱃놀이축제',
        1141: '음성품바축제',
        1142: '천안흥타령춤축제',
        1143: '지용제',
        1144: '밀양아리랑대축제',
        1145: '수성못페스티벌',
        1146: '포항국제불빛축제',
        1147: '시흥갯골축제',
        1148: '금호강바람소리길축제',
        1149: '한성백제문화제',
        1150: '공주석장리구석기축제',
        1151: '고령대가야축제',
        1152: '부안마실축제',
        1153: '원주한지문화제',
        1154: '울산쇠부리축제',
        1155: '곡성세계장미축제',
        1156: '춘천마임축제',
        1157: '한산모시문화제',
        1158: '대구치맥페스티벌',
        1159: '보령머드축제',
        1160: '봉화은어축제',
        1161: '정남진 장흥 물축제',
        1162: '하동섬진강재첩문화축제',
        1163: '인천펜타포트락페스티벌',
        1164: '통영한산대첩축제',
        1165: '무주반딧불축제',
        1166: '괴산고추축제',
        1167: '삼척정월대보름제',
        1168: '삼척맹방유채꽃행사',
        1169: '황영조 국제 마라톤 대회',
        1170: '삼척장미축제',
        1171: '삼척비치썸페스티벌',
        1172: '삼척동해왕이사부축제',
        1173: '삼척평생학습박람회 및 책축제',
        1174: '얼음나라화천 산천어축제',
        1175: '탐라국입춘굿축제',
        1176: '제주들불축제',
        1177: '영암왕인문화축제',
        1178: '보성다향대축제',
        1179: '진도신비의바닷길축제',
        1180: '함평나비대축제',
        1181: '문경찻사발축제',
        1182: '담양대나무축제',
        1183: '춘향제',
        1184: '하동야생차문화축제',
        1185: '삼척종합예술제',
        1186: '삼척민족예술제',
        1187: '치악산배축제',
        1188: '반계리 은행나무축제',
        1189: '제23회 섬강축제',
        1190: '강진청자축제',
        1191: '강진만 춤추는 갈대축제',
        1192: '강진하맥축제',
        1193: '강진수국길축제',
        1194: '강진 월출산봄소풍가는날 축제',
        1195: '전라병영성축제',
        1196: '설봉산별빛축제',
        1197: '체험문화축제',
        1198: 'INK 콘서트',
        1199: '인천펜타포트 음악축제',
        1200: '인천생활문화축제',
        1201: '섬마을밴드 음악축제',
        1202: 'all nights INCHEON 페스티벌 빛의 정원, 송도',
        1203: '동인천 낭만축제',
        1204: '용인어린이상상의숲 특별 행사 <상상해봄>(가칭)',
        1205: '용인어린이상상의숲 어린이 주간 특별 행사 <오, 오 상상이상>',
        1206: '<2023 피크닉 콘서트 - We Go Together Concert>',
        1207: '용인어린이상상의숲 가을특별행사 온 가족이 함께하는 <상상북크닉>',
        1208: '용인어린이상상의숲 특별행사 <메리 상상 크리스마스>',
        1209: '백운계곡 뜬구름 축제',
        1210: '억새꽃 축제',
        1211: '포천 백운계곡 동장군 축제',
        1212: '의왕백운호수축제',
        1213: '의왕철도축제',
        1214: '백화산 해맞이 행사',
        1215: '연포 해맞이 행사',
        1216: '2023 태화강마두희축제',
        1217: '2023년 외솔한글한마당',
        1218: '2023 문화의거리 현대미술제',
        1219: '2023년 울산병영3.1만세운동 제23회 재현행사',
        1220: '2023 목포항구축제',
        1221: '한여름밤의 축제',
        1222: '태화강 국가정원 봄꽃축제',
        1223: '울산대공원 장미축제',
        1224: '삼척정월대보름제',
        1225: '삼척맹방유채꽃행사',
        1226: '황영조 국제 마라톤 대회',
        1227: '삼척장미축제',
        1228: '삼척비치썸페스티벌',
        1229: '삼척동해왕이사부축제',
        1230: '삼척평생학습박람회 및 책축제',
        1231: '여주도자기축제',
        1232: '구로G페스티벌',
        1233: '해맞이축제',
        1234: '영덕대게축제',
        1235: '영덕황금은어축제',
        1236: '영덕물가자미축제',
        1237: '증평들노래축제',
        1238: '증평인삼골축제',
        1239: '양양문화제',
        1240: '양양 송이&연어축제',
        1241: '와룡산 와~봄 축제',
        1242: '달성토성마을축제',
        1243: '오감만족, 어린이날 큰 잔치',
        1244: '가족사랑 아이스축제',
        1245: '미소&행복 구민축제',
        1246: '달구벌목민관축제',
        1247: '해맞이축제',
        1248: '벌교꼬막축제',
        1249: '제21회 의정부음악극축제',
        1250: '제4회 블랙뮤직페스티벌',
        1251: '제10회 의정부국제가야금축제',
        1252: '<도서관 속 작업실 II>展',
        1253: '청소년 어울림마당 행복누리축제',
        1254: '청소년 문화 예술의 밤 흥선비긴어게인',
        1255: '의정부시 청소년 진로페스티벌',
        1256: '의정부시 청소년 행복주간  [명사특강 ]',
        1257: '청소년 행복 주간 및 청소년의 날',
        1258: '청소년 행복주간 지역마을축제(동부권역)',
        1259: '의정부시 청소년 행복주간  [가족뮤지컬 ]',
        1260: '청소년 행복주간 지역마을축제',
        1261: '청소년안전망 페스티발',
        1262: '청소년이 빛나는 밤',
        1263: '청소년 Party',
        1264: '청소년 종합예술제 끼자랑꿈자랑 경연대회',
        1265: '청소년이 빛나는 밤',
        1266: '청소년 스트레스 해소방안 탐색축제 (스트레스 팡팡)',
        1267: '전국청소년댄스페스티벌 꿈을 향한 무승부',
        1268: '청소년 종합예술제 끼자랑꿈자랑 한마당 축제',
        1269: '청소년 종합예술제 끼자랑꿈자랑 한마당 축제',
        1270: '의정부 청소년 영화제',
        1271: '청소년이 빛나는 밤',
        1272: '청소년 푸른별 콘서트',
        1273: '<사각사각> 展',
        1274: '의정부 중앙아시아 영화제',
        1275: '2023 회룡거리예술제',
        1276: '제10회 의정부시 가족문화대축제',
        1277: '애기동백축제',
        1278: '간재미 축제',
        1279: '흑산도홍어축제',
        1280: '섬 병어 축제',
        1281: '증도 송어 축제',
        1282: '2019 신안 섬 갯벌 축제',
        1283: '섬 깡다리 축제',
        1284: '전주대사습놀이',
        1285: '전주문화재야행',
        1286: '전주세계소리축제',
        1287: '전주독서대전',
        1288: '생거진천 문화축제',
        1289: '농다리 축제',
        1290: '동해무릉제',
        1291: '양록제',
        1292: '양구배꼽축제',
        1293: '양구사과시래기축제',
        1294: '양구곰취축제',
        1295: '강남 페스티벌',
        1296: '노래하는 대한민국(서초다움편)',
        1297: '서리풀페스티벌',
        1298: '말죽거리축제',
        1299: '우솔마을 축제',
        1300: '악기거리축제',
        1301: '잠원나루축제',
        1302: '서초골 축제',
        1303: '해맞이행사',
        1304: '정월대보름 달집태우기 행사',
        1305: '2023 동촌금호강예술제 Art Blossom',
        1306: '팔공산 벚꽃축제',
        1307: '선덕여왕 숭모재',
        1308: '안심창조밸리 연꽃마을 축제',
        1309: '팔공산 왕건축제',
        1310: '최계란 선생 대구아리랑제',
        1311: '용암산성 옥샘문화재',
        1312: '구민화합 어울림한마당',
        1313: '상화문학제',
        1314: '천을산 해맞이',
        1315: '2023 오산 크리스마스 마켓',
        1316: '거제비어페스타',
        1317: '청송사과축제',
        1318: '충주 우륵문화제',
        1319: '천령문화제',
        1320: '함양연암문화제',
        1321: '제18회 함양산삼축제',
        1322: '제7회 홍천강 별빛음악 맥주축제',
        1323: '2020 부평풍물대축제',
        1324: '2021 부평풍물대축제',
        1325: '2022 부평풍물대축제',
        1326: '2023 부평풍물대축제',
        1327: '제28회 남도음식문화큰잔치',
        1328: '2023 국제농업박람회',
        1329: '제104회 전국체육대회',
        1330: '제43회 전국장애인체육대회',
        1331: '광양매화축제',
        1332: '광양천년동백축제',
        1333: '백운산국사봉철쭉제',
        1334: '광양전어축제',
        1335: '광양숯불구이축제',
        1336: '광양k-pop 슈퍼 페스티벌',
        1337: '거제맹종대나무축제',
        1338: '거제 옥포대첩 축제',
        1339: '남부면 수국축제',
        1340: '거제 바다로 세계로',
        1341: '청마포도축제',
        1342: '제30회 물왕예술제(산현공원)',
        1343: '제30회 물왕예술제(비둘기공원)',
        1344: '제30회 물왕예술제(배곧생명공원)',
        1345: '지구촌 예술축제',
        1346: '제18회 영양산나물축제',
        1347: '2023 영양고추 H.O.T Festival',
        1348: '용전들노래 가을걷이 한마당',
        1349: '왕버들기원제',
        1350: '생생문화재',
        1351: '전통산사문화재',
        1352: '전주국제영화제',
        1353: '전주한지문화축제',
        1354: '제20회 사상전통달집놀이',
        1355: '삼강주막나루터축제',
        1356: '제20회 강북구 3·1독립운동 기념행사',
        1357: '4.19혁명 국민문화제',
        1358: '종교연합바자회',
        1359: '제17회 구리 유채꽃 축제',
        1360: '제17회 구리 코스모스 축제',
        1361: '제18회 구리 유채꽃 축제',
        1362: '제18회 구리 코스모스 축제',
        1363: '2023 관악어린이가족축제_관악봄봄',
        1364: '2023년 은계호수공원 가을콘서트',
        1365: '2022 하영올레 걷기 축제',
        1366: '제24회 서귀포유채꽃국제걷기대회',
        1367: '2022 제주유채꽃축제',
        1368: '제26회 한라산 청정 고사리 축제',
        1369: '제11회 서귀포 봄맞이축제',
        1370: '제1회 성산조개바당축제',
        1371: '제3회 서귀포 은갈치축제',
        1372: '제27회 표선해변 하얀모래축제',
        1373: '제7회 돈내코계곡 원앙축제',
        1374: '제18회 쇠소깍축제',
        1375: '제28회 서귀포칠십리축제',
        1376: '제23회 서귀포 겨울바다 국제펭귄수영대회',
        1377: '제30회 성산일출축제',
        1378: '제22회 최남단 방어축제',
        1379: '제29회 덕수리 전통민속 재현행사',
        1380: '2022 중문 칠선녀축제',
        1381: '제28회 제주 성읍마을 전통민속재현축제',
        1382: '제12회 혼인지축제',
        1383: '제20회 예래생태체험축제',
        1384: '원주삼토페스티벌',
        1385: '2023 서귀포유채꽃축제',
        1386: '제25회 서귀포유채꽃국제걷기대회',
        1387: '가파도청보리축제',
        1388: '한라산청정고사리축제',
        1389: '보목자리돔축제',
        1390: '제50회신라문화제',
        1391: '제50회신라문화제',
        1392: '화개장터벚꽃축제',
        1393: '하동야생차문화축제',
        1394: '2023하동세계차엑스포',
        1395: '토지문학제',
        1396: '하동북천꽃양귀비축제',
        1397: '하동섬진강문화재첩축제',
        1398: '평사리황금들판허수아비전시',
        1399: '하동북천코스모스메밀꽃축제',
        1400: '이병주하동국제문학제',
        1401: '퍼플섬 라벤더 축제',
        1402: '섬 수국 축제',
        1403: '섬 크로코스미아 꽃축제',
        1404: '원추리축제',
        1405: '섬 불볼락 축제',
        1406: '섬 새우젓 축제',
        1407: '섬 왕새우 축제',
        1408: '섬 맨드라미축제',
        1409: '회남재숲길걷기',
        1410: '악양대봉감축제',
        1411: '하동왕의녹차참숭어축제',
        1412: '중구미술협회전',
        1413: '중구미술협회전',
        1414: '중구미술협회전',
        1415: '중구미술협회전',
        1416: '봉산미술제',
        1417: '봉산미술제',
        1418: '봉산미술제',
        1419: '봉산미술제',
        1420: '봉산미술제',
        1421: '봉산미술제',
        1422: '봉산미술제',
        1423: '봉산미술제',
        1424: '봉산미술제',
        1425: '제28회 봉산미술제',
        1426: '제29회 봉산미술제',
        1427: '제30회 봉산미술제',
        1428: '김광석노래부르기',
        1429: '제15회 구리한강 유채꽃 축제',
        1430: '제15회 구리 코스모스 축제',
        1431: '제16회 구리한강 유채꽃 축제',
        1432: '제16회 구리 코스모스 축제',
        1433: '김광석노래부르기',
        1434: '제8회 김광석노래부르기',
        1435: '제9회 김광석노래부르기',
        1436: '제10회 김광석노래부르기',
        1437: '김광석길페스티벌',
        1438: '김광석길페스티벌',
        1439: '김광석길페스티벌',
        1440: '진주남강유등축제',
        1441: '개천예술제',
        1442: '코리아드라마페스티벌',
        1443: '진주논개제',
        1444: '진주 M2(뮤직&미디어)페스티벌',
        1445: '진주 전국민속 소힘겨루기대회',
        1446: '진주탈춤한마당',
        1447: '진주국제농식품박람회',
        1448: '2023 김포 아라마린페스티벌',
        1449: '2023 김포 평화누리길 걷기 행사',
        1450: '2022 경기인디뮤직페스티벌(삭제)',
        1451: '제55회 황토현동학농민혁명기념제',
        1452: '제33회 정읍사문화제',
        1453: '제15회 정읍 구절초꽃축제',
        1454: '제4회 新송도해변축제',
        1455: '제11회 연수 능허대 문화축제',
        1456: '제7회 홍천강 별빛음악 맥주축제',
        1457: '창녕 문화재 야행(창녕 별빛 마실)',
        1458: '산토끼와 따오기가 함께하는 창작동요제',
        1459: '창녕양파가요제',
        1460: '우포따오기와 함께하는 비사벌문화제',
        1461: '부곡온천축제',
        1462: '3.1민속문화제',
        1463: '낙동강유채축제',
        1464: '정월대보름 달맞이문화제',
        1465: '비슬산 참꽃문화제',
        1466: '성주참외&생명문화축제',
        1467: '문경찻사발축제',
        1468: '문경약돌한우축제',
        1469: '문경오미자축제',
        1470: '문경사과축제',
        1471: '제2회 강릉 비치비어페스티벌',
        1472: '2023 경포 벚꽃 잔치',
        1473: '2023 경포 썸머 페스티벌',
        1474: '2024 해돋이 행사',
        1475: '제15회 강릉 커피축제',
        1476: '제2회 강릉 와인축제',
        1477: '강릉문화재야행',
        1478: '강릉단오제 본행사',
        1479: '한마음축제',
        1480: '장보고수산물축제',
        1481: '청산도슬로걷기축제',
        1482: '경남고성공룡세계엑스포',
        1483: '필봉마을굿축제',
        1484: '임실N치즈축제',
        1485: '산타축제',
        1486: '의견문화제',
        1487: '명품콘서트',
        1488: '제1회 도촌 봄봄맞이길 벚꽃축제',
        1489: '제17회 벌터산한마당축제',
        1490: '제13회 성남 전국 사진촬영대회',
        1491: '문화와 예술이 어울어지는 미니콘서트',
        1492: '2023년 청계산 힐링 빛 축제',
        1493: '제17회 청계산 철쭉축제',
        1494: '지구촌 어울림 축제',
        1495: '영주한국선비문화축제',
        1496: '소백산철쭉제',
        1497: '영주 시원(ONE)축제',
        1498: '영주무섬외나무다리축제',
        1499: '경북영주 풍기인삼축제',
        1500: '군위 삼장군단오축제',
        1501: '김수환추기경 사랑과 나눔 문화축전',
        1502: '순창장류축제',
        1503: '광안리어방축제',
        1504: '동래읍성역사축제',
        1505: '영도다리축제',
        1506: '관악강감찬축제',
        1507: '이천쌀문화축제',
        1508: '광주세계김치축제',
        1509: '대전사이언스페스티벌',
        1510: '여주오곡나루축제',
        1511: '김해분청도자기축제',
        1512: '청송사과축제',
        1513: '영덕대게축제',
        1514: '황룡강 가을꽃축제',
        1515: '황룡강 (洪)길동무 꽃길 축제',
        1516: '백양단풍축제',
        1517: '축령산 편백산소축제',
        1518: '제35회 고양행주문화제',
        1519: '2023 고양호수예술축제',
        1520: '2023 양주 천만송이 천일홍 축제',
        1521: '정서진 해넘이 행사',
        1522: '아라뱃길 카약축제',
        1523: '제26회 무안연꽃축제',
        1524: '제9회 무안황토갯벌축제',
        1525: '영천보현산별빛축제',
        1526: '대천해수욕장 조개구이 한마당',
        1527: '제2회 보령AMC모터페스티벌',
        1528: '제26회 보령머드축제',
        1529: '진도문화예술제',
        1530: '명량대첩축제',
        1531: '2023 자유공원 벚꽃축제',
        1532: '2023 가족의 달 어린이축제',
        1533: '무의도 춤축제',
      };
      function showRandomFestival() {
        const randomNumber =
          Math.floor(Math.random() * Object.keys(festivalNames).length) + 1;
        const festivalName = festivalNames[randomNumber];
        document.getElementById('festivalName').textContent = festivalName;
      }

      // 페이지 로딩 후 5초마다 데이터 랜덤으로 표시
      showRandomFestival();
      setInterval(showRandomFestival, 5000); // 5000 밀리초(5초)
      // 헤더 랜덤 축제에 관련된 변수
      document.querySelector('.like').onclick = () => {
        fetch('${pageContext.request.contextPath}/user/likeList/' + `${login}`)
          .then((res) => res.json())
          .then((list) => {
            console.log(list);
            for (like of list) {
              str += `<div>` + like.ftvName + `/` + like.url + `</div>`;
            }

            document.querySelector('.ftv').insertAdjacentHTML('beforeend', str);
          });
      };
    </script>
  </body>
</html>
